# Installs OSX applications via Homebrew

# specify a directory to install
cask_args appdir: '/Applications'

tap "caskroom/cask"

# Utilities
cask "1password"
cask "flux"

# Design Tools
cask "zeplin"
cask "sketch"

# Programming Languages
brew "nvm"
brew "yarn"
brew "pyenv"

# Dev Tools
cask "docker"

# Productivity Tools
cask "alfred"
cask "spectacle"

# IDE's
cask "visual-studio-code"

# Communication Apps
cask "slack"
cask "skype"
cask "blue-jeans"

# Web Browsers
cask "google-chrome"
cask "firefox"

# REST Tools
cask "postman"

# Notetaking Apps
cask "boostnote"

# Entertainment
cask "vlc"
