# ------------------------------------------------------------------------------
# Installs OSX applications via Homebrew
# ------------------------------------------------------------------------------

# specify a directory to install
cask_args appdir: '/Applications'

tap "caskroom/cask"

# ------------------------------------------------------------------------------
# Design Tooling
# ------------------------------------------------------------------------------
cask "zeplin"
cask "sketch"
cask "omnigraffle"

# Adobe tools
cask "adobe-creative-cloud"

# ------------------------------------------------------------------------------
# Languages
# ------------------------------------------------------------------------------

## NodeJS
brew "nvm"          # node version manager
brew "yarn"         # node peer

# Python
brew "pyenv"        # python environment manager
brew "readline"     # pyenv dependancy
brew "xz"           # pyenv dependancy 
brew "zlib"         # pyenv dependancy

# R
brew "r"            # R

# Java
brew "jenv"         # Java environment manager
cask "java"         # latest version of java

# Scala
brew "scala"
brew "sbt"

# Go
brew "golang"

# ------------------------------------------------------------------------------
# Development Tooling
# ------------------------------------------------------------------------------
cask "docker"
brew "tmux"
cask "iterm2"
brew "bash-completion"
brew "watchman"
brew "selenium-server-standalone"

# ------------------------------------------------------------------------------
# TypeSetting
# ------------------------------------------------------------------------------
cask "mactex-no-gui"

# ------------------------------------------------------------------------------
# Productivity
# ------------------------------------------------------------------------------
cask "alfred"
cask "spectacle"
cask "microsoft-office"
cask "1password"
cask "flux"

# ------------------------------------------------------------------------------
# IDE
# ------------------------------------------------------------------------------
cask "visual-studio-code" 
cask "intellij-idea"
cask "atom"

# ------------------------------------------------------------------------------
# Database
# ------------------------------------------------------------------------------
brew "mysql"
brew "postgres"
cask "sequel-pro"

# ------------------------------------------------------------------------------
# Communication
# ------------------------------------------------------------------------------
cask "slack"
cask "skype"
cask "blue-jeans"

# ------------------------------------------------------------------------------
# Web Browsers
# ------------------------------------------------------------------------------
cask "google-chrome"
cask "firefox"

# ------------------------------------------------------------------------------
# REST Tools
# ------------------------------------------------------------------------------
cask "postman"
cask "wireshark"

# ------------------------------------------------------------------------------
# Notetaking Apps
# ------------------------------------------------------------------------------
cask "boostnote"
cask "evernote"

# ------------------------------------------------------------------------------
# Entertainment
# ------------------------------------------------------------------------------
cask "vlc"
